# StructWallAnalyticalErrorAlign Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..StructWallAnalyticalErrorAlign Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Can't align Analytical Model with joined Walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructWallAnalyticalErrorAlign { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructWallAnalyticalErrorAlign As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorAlign {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace